{
  "name": "Bernard Ayamboro",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Bernard Ayamboro - A passionate",
  "headerTaglineThree": "Software Engineer",
  "headerTaglineFour": " based in london, UK.",
  "showCursor": false,
  "showBlog": false,
  "darkMode": true,
  "showResume": true,
  "socials": [
    { "id": "1", "title": "Github", "link": "https://github.com/bernard493" },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/bernard-ayamboro-001469209/"
    },
    { "id": "3", "title": "Email", "link": "mailto:bernardayam493@gmail.com" }
  ],
  "projects": [
    {
      "id": "1",
      "title": "VACANSA",
      "description": "An innovative React Native full-stack app, seamlessly integrating Express.js, Firebase Authentication and Admin, and MongoDB. Built to deliver a dynamic and secure mobile experience, this project showcases my expertise in crafting robust, cross-platform applications with cutting-edge technologies.",
      "imageSrc": "https://firebasestorage.googleapis.com/v0/b/vacanza-3729c.appspot.com/o/portfolio-project-images%2Fvacansa%20(1).png?alt=media&token=c7586981-e8c1-4ad7-9f23-358afb3ca2dc",
      "url": "https://expo.dev/preview/update?message=%5Border%20placing%20bug%20fixed%20---%20minor%20typo%20in%20confirm%20booking%20page%20%5D&updateRuntimeVersion=1.0.2(1)&createdAt=2024-07-07T23%3A27%3A06.204Z&slug=exp&projectId=5b2016fd-1538-4564-9e38-1edf1109c566&group=ca9c84ff-3681-40ca-b58c-de5f855ee4b2",
      "techStack": [
        "React Native",
        "Expo",
        "NodeJS",
        "ExpressJs",
        "MongoDB",
        "Tailwind Css",
        "React",
        "TypeScript"
      ]
    },
    {
      "id": "2",
      "title": "REST COUNTRIES",
      "description": "Rest Countries is a web application designed to provide users with comprehensive information about countries worldwide. Leveraging a public API, the platform enables users to search for specific countries, browse through a list of all countries, and access detailed information about each country. Key features include country search functionality, a sortable country list, and detailed country profiles. The application is built using React.js for the frontend, with options for state management using React Context API or Redux, and styling with Tailwind Css. It is designed to be responsive and can be deployed using platforms like Vercel, Netlify, or GitHub Pages. Ultimately, Rest Countries aims to enhance users' understanding and appreciation of global diversity and culture.",
      "imageSrc": "https://firebasestorage.googleapis.com/v0/b/vacanza-3729c.appspot.com/o/portfolio-project-images%2Frest-countries.png?alt=media&token=7fdf37c6-da32-4d0f-96d3-28d42657ee52",
      "url": "https://bernard-restcountries.netlify.app/",
      "techStack": ["React", "Rest API", "Redux", "Tailwind Css"]
    },
    {
      "id": "4565b17e-9c11-42bd-b3b0-7e32d0fe3ef7",
      "title": "Monzo Demo Clone",
      "description": "The Monzo Demo Clone for authentication screens is a simulated version of the authentication flow used in the Monzo banking application. It replicates the user interface and functionality of Monzo's login and registration screens for demonstration or educational purposes. This clone typically includes features such as email/username/password login, social media authentication (e.g., Google, Facebook), password recovery, and user registration. By mimicking the Monzo authentication process.",
      "imageSrc": "https://firebasestorage.googleapis.com/v0/b/vacanza-3729c.appspot.com/o/portfolio-project-images%2FFN-AL530_FN_MON_J_20201020062913.jpg?alt=media&token=3955ea0a-f428-4fbd-a836-abbb045e4c8e",
      "url": "https://expo.dev/preview/update?message=Monzo%20Demo%20clone&updateRuntimeVersion=1.0.0&createdAt=2024-04-25T22%3A06%3A02.235Z&slug=exp&projectId=fb826014-ad11-4b21-851b-171f92540269&group=e80a10af-5109-4c49-9c8e-8204988ef8f7",
      "techStack": ["React Native", "Expo"]
    }
  ],
  "services": [],
  "aboutpara": "Ever since I can remember, my fascination with technology has been the driving force behind my journey. Fuelled by an unwavering passion to innovate, I'm on a mission to create tech solutions that redefine the way we connect and interact, much like the transformative platforms of today. My journey in technology is marked by a relentless pursuit of knowledge and a thirst for creativity. From mastering programming languages to exploring cutting-edge technologies, every step has been guided by a vision to craft impactful tools that resonate with users on a global scale. Inspired by giants like Facebook, my goal is not just to build software, but to architect experiences that empower and enrich lives. It's about leveraging technology to break barriers, foster meaningful connections, and pave the way for a brighter future.As I continue to push the boundaries of innovation, I remain steadfast in my commitment to learning, growing, and collaborating with like-minded individuals. Together, we can turn dreams into reality and shape the future of technology for generations to come.",
  "resume": {
    "tagline": "👋  I'm a software engineer,",
    "description": "Software Engineer with expertise in HTML, CSS, JavaScript, TypeScript, React, and React Native, along with backend skills in ExpressJs, MongoDB, and Firebase. Successfully developed an MVP, showcasing full-cycle development and REST API design. Known for creating responsive, user-centric web applications with strong problem-solving and innovative design skills.",
    "experiences": [
     {
        "id": "4f65-479a-9b8a-d495c23b",
        "dates": "JUN  2020 ,  JAN 2022  ",
        "type": "FULL TIME",
        "position": "Frontend Developer at Agocarry Technology",
        "bullets": [
          "Developed responsive web applications using HTML, CSS, and JavaScript, integrating Tailwind CSS and SASS for efficient styling.",
          "Built and maintained dynamic features with React JS, Redux, utilizing Firebase and REST APIs for backend integration.",
          ".Collaborated on cross-platform mobile apps with React Native and Expo, using Node.js, Express.js, and MongoDB for full-stack development"
        ]
      },
      {
        "id": "9b8a",
        "dates": "Dec 2022 - Jan 2024",
        "type": "Personal Project",
        "position": "FullStack React Native ",
        "bullets": [
          "Developed a user-friendly full-stack React Native hotel booking app using Expo, Redux, and Axios, facilitating seamless room bookings.",
          "Implemented Express.js, MongoDB, and Firebase Admin for secure backend development, including robust database management and image storage."
        ]
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "Jan , 2023",
        "type": "Personal Project",
        "position": "REST COUNTRIES",
        "bullets": [
          " Deployed the application on platforms like Vercel, Netlify, or GitHub Pages for accessibility and scalability.",
          "Developed Rest Countries, a responsive React.js web application with country search, sortable lists, and detailed profiles, using a public API for data and styled with Tailwind CSS, and managed state with React Context API or Redux."
        ]
      },
      {
        "id": "d495c23bT68976787--4f65-479a-9b8a-cfbc1c089725",
        "dates": "Nov 2023",
        "type": "Personal Project",
        "position": "REACT NATIVE MONZO DEMO CLONE",
        "bullets": [
          "The Monzo Demo Clone for authentication screens is a simulated version of the authentication flow used in the Monzo banking application."
        ]
      }
    ],
    "educations": [
      {
        "id": "uyw34w2we89wguis",
        "universityName": "BrainStation, London Uk",
        "universityDate": "Fed 2024 - Present",
        "universityPara": "Computer Software Engineering"
      },
      {
        "id": "uyw89w34r5eguis",
        "universityName": "FreeCodeCamp",
        "universityDate": "Nov-2022",
        "universityPara": "Responsive Web  Design Certification"
      },
      {
        "id": "uyw8345rrrv49wguis",
        "universityName": "University of Professional Studies, Accra Ghana",
        "universityDate": "Jun 2018 - 2020",
        "universityPara": "Diploma in Information Technology Management"
      }
    ],
    "languages": ["Javascript", "HTML5", "CSS"],
    "frameworks": [
      "React",
      "React Native",
      "Typescript",
      "NodeJs",
      "ExpressJs"
    ],
    "others": ["Figma"]
  }
}
